[Timeout] BlockStatement
src/middleware/auth.middleware.ts:15:7
   _res: Response,
   next: NextFunction
 ) => {
-  try {
-    const authHeader = req.headers.authorization;
-
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
-      throw new AppError('Token não fornecido', 401);
-    }
-
-    const token = authHeader.substring(7);
-    const secret = process.env.JWT_SECRET;
-
-    if (!secret) {
-      throw new Error('JWT_SECRET não configurado');
-    }
-
-    const decoded = jwt.verify(token, secret) as { userId: string; role: string };
-
-    req.userId = decoded.userId;
-    req.userRole = decoded.role;
-
-    next();
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof jwt.JsonWebTokenError) {
       next(new AppError('Token inválido', 401));

[Timeout] BooleanLiteral
src/middleware/auth.middleware.ts:18:24
   try {
     const authHeader = req.headers.authorization;
 
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
+    if (!authHeader || authHeader.startsWith('Bearer ')) {
       throw new AppError('Token não fornecido', 401);
     }

[Timeout] MethodExpression
src/middleware/auth.middleware.ts:18:25
   try {
     const authHeader = req.headers.authorization;
 
-    if (!authHeader || !authHeader.startsWith('Bearer ')) {
+    if (!authHeader || !authHeader.endsWith('Bearer ')) {
       throw new AppError('Token não fornecido', 401);
     }

[Timeout] MethodExpression
src/middleware/auth.middleware.ts:22:19
       throw new AppError('Token não fornecido', 401);
     }
 
-    const token = authHeader.substring(7);
+    const token = authHeader;
     const secret = process.env.JWT_SECRET;
 

[NoCoverage] StringLiteral
src/middleware/auth.middleware.ts:26:23
     const secret = process.env.JWT_SECRET;
 
     if (!secret) {
-      throw new Error('JWT_SECRET não configurado');
+      throw new Error("");
     }
 

[Killed] BlockStatement
src/middleware/auth.middleware.ts:35:19
     req.userRole = decoded.role;
 
     next();
-  } catch (error) {
-    if (error instanceof jwt.JsonWebTokenError) {
-      next(new AppError('Token inválido', 401));
-    } else {
-      next(error);
-    }
-  }
+  } catch (error) {}
 };
 
killedBy: Auth Middleware authenticate deve negar acesso sem token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<AppError>

Number of calls: 0

[Survived] ConditionalExpression
src/middleware/auth.middleware.ts:36:9
 
     next();
   } catch (error) {
-    if (error instanceof jwt.JsonWebTokenError) {
+    if (true) {
       next(new AppError('Token inválido', 401));
     } else {

[NoCoverage] BlockStatement
src/middleware/auth.middleware.ts:36:49
 
     next();
   } catch (error) {
-    if (error instanceof jwt.JsonWebTokenError) {
-      next(new AppError('Token inválido', 401));
-    } else {
+    if (error instanceof jwt.JsonWebTokenError) {} else {
       next(error);
     }

[NoCoverage] StringLiteral
src/middleware/auth.middleware.ts:37:25
     next();
   } catch (error) {
     if (error instanceof jwt.JsonWebTokenError) {
-      next(new AppError('Token inválido', 401));
+      next(new AppError("", 401));
     } else {
       next(error);

[Killed] BlockStatement
src/middleware/auth.middleware.ts:38:12
   } catch (error) {
     if (error instanceof jwt.JsonWebTokenError) {
       next(new AppError('Token inválido', 401));
-    } else {
-      next(error);
-    }
+    } else {}
   }
 };
killedBy: Auth Middleware authenticate deve negar acesso sem token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<AppError>

Number of calls: 0

[Killed] BlockStatement
src/middleware/auth.middleware.ts:45:68
 };
 
 export const authorize = (...roles: string[]) => {
-  return (req: AuthRequest, _res: Response, next: NextFunction) => {
-    if (!req.userRole) {
-      return next(new AppError('Acesso negado', 403));
-    }
-
-    if (!roles.includes(req.userRole)) {
-      return next(new AppError('Permissão insuficiente', 403));
-    }
-
-    next();
-  };
+  return (req: AuthRequest, _res: Response, next: NextFunction) => {};
 };
 
killedBy: Auth Middleware authorize deve negar se role não permitido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<AppError>

Number of calls: 0

[Killed] ConditionalExpression
src/middleware/auth.middleware.ts:50:9
       return next(new AppError('Acesso negado', 403));
     }
 
-    if (!roles.includes(req.userRole)) {
+    if (false) {
       return next(new AppError('Permissão insuficiente', 403));
     }
killedBy: Auth Middleware authorize deve negar se role não permitido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<AppError>
Received: called with 0 arguments

Number of calls: 1

[Killed] BooleanLiteral
src/middleware/auth.middleware.ts:50:9
       return next(new AppError('Acesso negado', 403));
     }
 
-    if (!roles.includes(req.userRole)) {
+    if (roles.includes(req.userRole)) {
       return next(new AppError('Permissão insuficiente', 403));
     }
killedBy: Auth Middleware authorize deve negar se role não permitido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<AppError>
Received: called with 0 arguments

Number of calls: 1
