[Survived] BooleanLiteral
src/middleware/errorHandler.ts:11:26
   constructor(message: string, statusCode: number = 500) {
     super(message);
     this.statusCode = statusCode;
-    this.isOperational = true;
+    this.isOperational = false;
     Error.captureStackTrace(this, this.constructor);
   }

[Killed] BlockStatement
src/middleware/errorHandler.ts:21:6
   _req: Request,
   res: Response,
   _next: NextFunction
-) => {
-  // Tratamento de erros do Zod
-  if (err instanceof ZodError) {
-    const firstError = err.errors[0];
-    return res.status(400).json({
-      error: firstError?.message || 'Dados inválidos',
-      statusCode: 400,
-      details: process.env.NODE_ENV === 'development' ? err.errors : undefined
-    });
-  }
-
-  if (err instanceof AppError) {
-    return res.status(err.statusCode).json({
-      error: err.message,
-      statusCode: err.statusCode
-    });
-  }
-
-  // Erro não tratado
-  console.error('Unhandled error:', err);
-  return res.status(500).json({
-    error: 'Internal server error',
-    message: process.env.NODE_ENV === 'development' ? err.message : undefined
-  });
-};
+) => {};
 
 
killedBy: Error Handler Middleware deve tratar ZodError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BlockStatement
src/middleware/errorHandler.ts:23:32
   _next: NextFunction
 ) => {
   // Tratamento de erros do Zod
-  if (err instanceof ZodError) {
-    const firstError = err.errors[0];
-    return res.status(400).json({
-      error: firstError?.message || 'Dados inválidos',
-      statusCode: 400,
-      details: process.env.NODE_ENV === 'development' ? err.errors : undefined
-    });
-  }
+  if (err instanceof ZodError) {}
 
   if (err instanceof AppError) {
killedBy: Error Handler Middleware deve tratar ZodError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] ConditionalExpression
src/middleware/errorHandler.ts:26:14
   if (err instanceof ZodError) {
     const firstError = err.errors[0];
     return res.status(400).json({
-      error: firstError?.message || 'Dados inválidos',
+      error: true,
       statusCode: 400,
       details: process.env.NODE_ENV === 'development' ? err.errors : undefined

[Survived] ConditionalExpression
src/middleware/errorHandler.ts:26:14
   if (err instanceof ZodError) {
     const firstError = err.errors[0];
     return res.status(400).json({
-      error: firstError?.message || 'Dados inválidos',
+      error: false,
       statusCode: 400,
       details: process.env.NODE_ENV === 'development' ? err.errors : undefined

[Survived] ConditionalExpression
src/middleware/errorHandler.ts:28:16
     return res.status(400).json({
       error: firstError?.message || 'Dados inválidos',
       statusCode: 400,
-      details: process.env.NODE_ENV === 'development' ? err.errors : undefined
+      details: true ? err.errors : undefined
     });
   }

[Survived] EqualityOperator
src/middleware/errorHandler.ts:28:16
     return res.status(400).json({
       error: firstError?.message || 'Dados inválidos',
       statusCode: 400,
-      details: process.env.NODE_ENV === 'development' ? err.errors : undefined
+      details: process.env.NODE_ENV !== 'development' ? err.errors : undefined
     });
   }

[Killed] BlockStatement
src/middleware/errorHandler.ts:32:32
     });
   }
 
-  if (err instanceof AppError) {
-    return res.status(err.statusCode).json({
-      error: err.message,
-      statusCode: err.statusCode
-    });
-  }
+  if (err instanceof AppError) {}
 
   // Erro não tratado
killedBy: Error Handler Middleware deve tratar AppError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
src/middleware/errorHandler.ts:33:44
   }
 
   if (err instanceof AppError) {
-    return res.status(err.statusCode).json({
-      error: err.message,
-      statusCode: err.statusCode
-    });
+    return res.status(err.statusCode).json({});
   }
 
killedBy: Error Handler Middleware deve tratar AppError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Erro customizado",
-   "statusCode": 403,

[Survived] ObjectLiteral
src/middleware/errorHandler.ts:41:31
 
   // Erro não tratado
   console.error('Unhandled error:', err);
-  return res.status(500).json({
-    error: 'Internal server error',
-    message: process.env.NODE_ENV === 'development' ? err.message : undefined
-  });
+  return res.status(500).json({});
 };
 

[Survived] ConditionalExpression
src/middleware/errorHandler.ts:43:14
   console.error('Unhandled error:', err);
   return res.status(500).json({
     error: 'Internal server error',
-    message: process.env.NODE_ENV === 'development' ? err.message : undefined
+    message: true ? err.message : undefined
   });
 };

[Survived] EqualityOperator
src/middleware/errorHandler.ts:43:14
   console.error('Unhandled error:', err);
   return res.status(500).json({
     error: 'Internal server error',
-    message: process.env.NODE_ENV === 'development' ? err.message : undefined
+    message: process.env.NODE_ENV !== 'development' ? err.message : undefined
   });
 };
